Revit 2018 API
FabricationPart Properties
The FabricationPart type exposes the following members.
Properties
Name | Description
Alias
 The alias of the fabrication part.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BottomOfPartElevation
 The associated elevation to the bottom of fabrication part off of the current level.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ConnectorManager
 The connector manager of the fabrication part.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CutType
 The cut type of the fabrication part.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
DomainType
 The domain type for the fabrication part.
DoubleWallMaterial
 The double wall material identifier of the fabrication part.
DoubleWallMaterialArea
 The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
DoubleWallMaterialThickness
 The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HangerRodKit
 Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
HasDoubleWall
 True if the fabrication part is double walled.
HasInsulation
 True if the fabrication part is insulated.
HasLining
 True if the fabrication part is lined.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
InsulationArea
 The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationSpecification
 The fabrication part insulation specification identifier.
InsulationThickness
 The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationType
 The insulation type of the fabrication part.
IsBoughtOut
 True if the fabrication part is bought out.
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
ItemCustomId
 The item custom identifier for the fabrication part.
ItemNumber
 The item number that is used for identification, re-ordering from shop.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LevelOffset
 The associated level offset that indicates the distance from the center of the fabrication part to the current level.
LiningArea
 The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
LiningThickness
 The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
LiningType
 The lining type of the fabrication part.
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Material
 The fabrication material identifier.
MaterialThickness
 The material thickness of the fabrication part.
Name
A human readable name for the Element.
 (Inherited from Element.)
Notes
 The notes of the fabrication part.
Origin
 The origin of the fabrication part element.
OverallSize
 The overall size of the fabrication part.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PartGuid
 The fabrication part's globally unique identifier.
PartStatus
 The status identifier for the fabrication part.
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
ProductCode
 The current database id of the part within the fabrication database.
ProductDataRange
 The product data range of the fabrication part.
ProductFinishDescription
 The product finish description of the fabrication part.
ProductInstallType
 The product install type of the fabrication part.
ProductListEntry
 The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.
ProductLongDescription
 The product long description of the fabrication part.
ProductMaterialDescription
 The product material description of the fabrication part.
ProductName
 The product name of the fabrication part.
ProductOriginalEquipmentManufacture
 The product original equipment manufacture (OEM) of the fabrication part.
ProductShortDescription
 The product short description of the fabrication part.
ProductSizeDescription
 The product size description of the fabrication part.
ProductSpecificationDescription
 The product specification description of the fabrication part.
ServiceAbbreviation
 The associated service abbreviation for the fabrication service.
ServiceId
 The fabrication part service identifier. The service can only be changed to compatible services.
ServiceName
 The name of the service associated with the fabrication part.
ServiceType
 The service type identifier of the fabrication part.
SheetMetalArea
 The sheet metal area of the fabrication part.
Size
 The size of the fabrication part.
Slope
 The slope for the straight fabrication part.
Specification
 The fabrication part specification identifier.
SpoolName
 The spool name of the fabrication part.
TopOfPartElevation
 The associated elevation to the top of fabrication part off of the current level.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ValidationStatus
 The validation status of the fabrication part.
Vendor
 The vendor of the fabrication part.
VendorCode
 The vendor code of the fabrication part.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Weight
 The weight of the fabrication part.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace